interop-mock/src/main/resources/whitemesa/soap12/test-rpc/echoIntegerArray-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:echoIntegerArray soapenv:encodingStyle="http://www.w3.org/2003/05/soap-encoding" xmlns:ns1="http://example.org/ts-tests">
         <inputIntegerArray soapenc:itemType="xsd:int" soapenc:arraySize="3" xsi:type="soapenc:Array" xmlns:soapenc="http://www.w3.org/2003/05/soap-encoding">
            <inputIntegerArray id="id0" xsi:type="xsd:int">1</inputIntegerArray>
            <inputIntegerArray id="id1" xsi:type="xsd:int">2</inputIntegerArray>
            <inputIntegerArray id="id2" xsi:type="xsd:int">3</inputIntegerArray>
         </inputIntegerArray>
      </ns1:echoIntegerArray>
   </soapenv:Body>
</soapenv:Envelope>